In [3]:
import numpy as np
import pandas as pd

In [7]:
a = pd.Series(data = [1776, 1867, 1821], index = ["india", "USA", "Afganistan"])

In [9]:
a

india         1776
USA           1867
Afganistan    1821
dtype: int64

In [13]:
a= np.random.randint(1,100,4)
a

array([81, 45, 20, 97])

In [17]:
ages = pd.Series(a, index = ["RAm", "Blue", "red", "black"])

In [19]:
ages = pd.Series({'a':4,"b":5, "c":6})

In [21]:
ages

a    4
b    5
c    6
dtype: int64

In [26]:
q1={'Japan':80, 'China':450, 'India': 200, "USA":250}
q2 = {'Brazil':100, 'China':500, 'India':200, 'USA':250}
sales_q1 = pd.Series(q1)
sales_q2 = pd.Series(q2)
print(sales_q1)
print(sales_q2)

Japan     80
China    450
India    200
USA      250
dtype: int64
Brazil    100
China     500
India     200
USA       250
dtype: int64

In [28]:
sales_q1+sales_q2

Brazil      NaN
China     950.0
India     400.0
Japan       NaN
USA       500.0
dtype: float64

In [32]:
sales_q1.add(sales_q2, fill_value = 0)

Brazil    100.0
China     950.0
India     400.0
Japan      80.0
USA       500.0
dtype: float64

In [41]:
df = pd.read_csv("MS_Dhoni_ODI_record.csv")

In [45]:
df['opposition'] = df['opposition'].str.replace('v ', '', regex = False)

In [47]:
df.head()

,score,runs_scored,balls_faced,strike_rate,fours,sixes,opposition,ground,date,odi_number
0,0,0,1,0,0,0,v Bangladesh,Chattogram,23/12/2004,ODI # 2199
1,12,12,11,109.09,2,0,v Bangladesh,Dhaka,26/12/2004,ODI # 2201
2,7*,7,2,350,0,1,v Bangladesh,Dhaka,27/12/2004,ODI # 2202
3,3,3,7,42.85,0,0,v Pakistan,Kochi,02/04/2005,ODI # 2235
4,148,148,123,120.32,15,4,v Pakistan,Visakhapatnam,05/04/2005,ODI # 2236

In [50]:
df['date'] = pd.to_datetime(df['date'], dayfirst = True)

In [56]:
df['date'].dt.year.astype(int)

0      2004
1      2004
2      2004
3      2005
4      2005
       ...
345    2019
346    2019
347    2019
348    2019
349    2019
Name: date, Length: 350, dtype: int32

In [60]:
df['score'] = df['score'].apply(str)

In [68]:
df['not_out'] = np.where(df['score'].str.endswith('*'), 1, 0)

In [70]:
df['not_out']

0      0
1      0
2      1
3      0
4      0
      ..
345    1
346    1
347    0
348    0
349    0
Name: not_out, Length: 350, dtype: int32

In [72]:
dfn = df.loc[((df['score'] != 'DNB') & (df['score'] != 'TDNB')), 'runs_scored':]

In [74]:
dfn

,runs_scored,balls_faced,strike_rate,fours,sixes,opposition,ground,date,odi_number,not_out
0,0,1,0,0,0,v Bangladesh,Chattogram,2004-12-23,ODI # 2199,0
1,12,11,109.09,2,0,v Bangladesh,Dhaka,2004-12-26,ODI # 2201,0
2,7,2,350,0,1,v Bangladesh,Dhaka,2004-12-27,ODI # 2202,1
3,3,7,42.85,0,0,v Pakistan,Kochi,2005-04-02,ODI # 2235,0
4,148,123,120.32,15,4,v Pakistan,Visakhapatnam,2005-04-05,ODI # 2236,0
...,...,...,...,...,...,...,...,...,...,...
344,28,52,53.84,3,0,v Afghanistan,Southampton,2019-06-22,ODI # 4169,0
345,56,61,91.8,3,2,v West Indies,Manchester,2019-06-27,ODI # 4175,1
346,42,31,135.48,4,1,v England,Birmingham,2019-06-30,ODI # 4179,1
347,35,33,106.06,4,0,v Bangladesh,Birmingham,2019-07-02,ODI # 4182,0
349,50,72,69.44,1,1,v New Zealand,Manchester,2019-07-09,ODI # 4190,0

In [78]:
df['date'].dt.date.min()

datetime.date(2004, 12, 23)

In [80]:
df['date'].dt.date.max()

datetime.date(2019, 7, 9)

In [82]:
df['date'].dt.date.min().strftime('%B %d %Y')

'December 23 2004'

In [86]:
ops_count = df['opposition'].value_counts()

In [ ]:
dfn.groupby('opposition')[